tutorials/testcases/freeSurface/flowOverStep/single/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
   inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            outletPhaseMeanVelocity;
        alpha           alpha.water;
        Umean           1;
        value           $internalField;
    }
    slipWall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "inner|outer"
    {
        type            bellerophon;
        value           $internalField;
    }
}


// ************************************************************************* //
