tutorials/testcases/freeSurface/flowOverStep/single/system/probeLocations
    (0.0016666666666666668 0.0016666666666666668 0.005)
    (0.0016666666666666668 0.005 0.005)
    (0.0016666666666666668 0.008333333333333333 0.005)
    (0.0016666666666666668 0.011666666666666667 0.005)
    (0.0016666666666666668 0.015000000000000001 0.005)
    (0.0016666666666666668 0.018333333333333333 0.005)
    (0.0016666666666666668 0.021666666666666667 0.005)
    (0.0016666666666666668 0.025 0.005)
    (0.0016666666666666668 0.028333333333333335 0.005)
    (0.0016666666666666668 0.03166666666666667 0.005)
    (0.0016666666666666668 0.035 0.005)
    (0.0016666666666666668 0.03833333333333334 0.005)
    (0.0016666666666666668 0.04166666666666667 0.005)
    (0.0016666666666666668 0.045000000000000005 0.005)
    (0.0016666666666666668 0.04833333333333334 0.005)
    (0.0016666666666666668 0.05166666666666667 0.005)
    (0.0016666666666666668 0.055 0.005)
    (0.0016666666666666668 0.058333333333333334 0.005)
    (0.0016666666666666668 0.06166666666666667 0.005)
    (0.0016666666666666668 0.065 0.005)
    (0.0016666666666666668 0.06833333333333334 0.005)
    (0.0016666666666666668 0.07166666666666667 0.005)
    (0.0016666666666666668 0.07500000000000001 0.005)
    (0.0016666666666666668 0.07833333333333334 0.005)
    (0.0016666666666666668 0.08166666666666667 0.005)
    (0.0016666666666666668 0.085 0.005)
    (0.0016666666666666668 0.08833333333333333 0.005)
    (0.0016666666666666668 0.09166666666666667 0.005)
    (0.0016666666666666668 0.095 0.005)
    (0.0016666666666666668 0.09833333333333334 0.005)
    (0.005 0.0016666666666666668 0.005)
    (0.005 0.005 0.005)
    (0.005 0.008333333333333333 0.005)
    (0.005 0.011666666666666667 0.005)
    (0.005 0.015000000000000001 0.005)
    (0.005 0.018333333333333333 0.005)
    (0.005 0.021666666666666667 0.005)
    (0.005 0.025 0.005)
    (0.005 0.028333333333333335 0.005)
    (0.005 0.03166666666666667 0.005)
    (0.005 0.035 0.005)
    (0.005 0.03833333333333334 0.005)
    (0.005 0.04166666666666667 0.005)
    (0.005 0.045000000000000005 0.005)
    (0.005 0.04833333333333334 0.005)
    (0.005 0.05166666666666667 0.005)
    (0.005 0.055 0.005)
    (0.005 0.058333333333333334 0.005)
    (0.005 0.06166666666666667 0.005)
    (0.005 0.065 0.005)
    (0.005 0.06833333333333334 0.005)
    (0.005 0.07166666666666667 0.005)
    (0.005 0.07500000000000001 0.005)
    (0.005 0.07833333333333334 0.005)
    (0.005 0.08166666666666667 0.005)
    (0.005 0.085 0.005)
    (0.005 0.08833333333333333 0.005)
    (0.005 0.09166666666666667 0.005)
    (0.005 0.095 0.005)
    (0.005 0.09833333333333334 0.005)
    (0.008333333333333333 0.0016666666666666668 0.005)
    (0.008333333333333333 0.005 0.005)
    (0.008333333333333333 0.008333333333333333 0.005)
    (0.008333333333333333 0.011666666666666667 0.005)
    (0.008333333333333333 0.015000000000000001 0.005)
    (0.008333333333333333 0.018333333333333333 0.005)
    (0.008333333333333333 0.021666666666666667 0.005)
    (0.008333333333333333 0.025 0.005)
    (0.008333333333333333 0.028333333333333335 0.005)
    (0.008333333333333333 0.03166666666666667 0.005)
    (0.008333333333333333 0.035 0.005)
    (0.008333333333333333 0.03833333333333334 0.005)
    (0.008333333333333333 0.04166666666666667 0.005)
    (0.008333333333333333 0.045000000000000005 0.005)
    (0.008333333333333333 0.04833333333333334 0.005)
    (0.008333333333333333 0.05166666666666667 0.005)
    (0.008333333333333333 0.055 0.005)
    (0.008333333333333333 0.058333333333333334 0.005)
    (0.008333333333333333 0.06166666666666667 0.005)
    (0.008333333333333333 0.065 0.005)
    (0.008333333333333333 0.06833333333333334 0.005)
    (0.008333333333333333 0.07166666666666667 0.005)
    (0.008333333333333333 0.07500000000000001 0.005)
    (0.008333333333333333 0.07833333333333334 0.005)
    (0.008333333333333333 0.08166666666666667 0.005)
    (0.008333333333333333 0.085 0.005)
    (0.008333333333333333 0.08833333333333333 0.005)
    (0.008333333333333333 0.09166666666666667 0.005)
    (0.008333333333333333 0.095 0.005)
    (0.008333333333333333 0.09833333333333334 0.005)
    (0.011666666666666667 0.0016666666666666668 0.005)
    (0.011666666666666667 0.005 0.005)
    (0.011666666666666667 0.008333333333333333 0.005)
    (0.011666666666666667 0.011666666666666667 0.005)
    (0.011666666666666667 0.015000000000000001 0.005)
    (0.011666666666666667 0.018333333333333333 0.005)
    (0.011666666666666667 0.021666666666666667 0.005)
    (0.011666666666666667 0.025 0.005)
    (0.011666666666666667 0.028333333333333335 0.005)
    (0.011666666666666667 0.03166666666666667 0.005)
...
    (0.09833333333333334 0.09833333333333334 0.005)
